
## Plan Result (shareable-lists-api-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/50871)


### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 0 to change, 1 to destroy.</code></pre>

* Create
  * local_file.application_ecs_service_appspec_94386B9C
* Replace
  * aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4 must be replaced
-/+ resource "aws_ecs_task_definition" "application_ecs_service_ecs-task_461CC9D4" {
      ~ arn                      = "arn:aws:ecs:us-east-1:996905175585:task-definition/ShareableListsApi-Prod:347" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:996905175585:task-definition/ShareableListsApi-Prod" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ image                  = "996905175585.dkr.ecr.us-east-1.amazonaws.com/shareablelistsapi-prod-app:9fe2a81e68d04e6b72d7057b7a3def58cedfcf99" -> "996905175585.dkr.ecr.us-east-1.amazonaws.com/shareablelistsapi-prod-app:7b1a8e5be6224bc6693734c1edbee8cce158220f"
                    name                   = "app"
                  ~ portMappings           = [
                      ~ {
                          - protocol      = "tcp"
                            # (2 unchanged attributes hidden)
                        },
                    ]
                    # (9 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "ShareableListsApi-Prod" -> (known after apply)
      ~ revision                 = 347 -> (known after apply)
        tags                     = {
            "environment" = "Prod"
            "service"     = "ShareableListsApi"
        }
        # (9 unchanged attributes hidden)
    }

  # local_file.application_ecs_service_appspec_94386B9C will be created
  + resource "local_file" "application_ecs_service_appspec_94386B9C" {
      + content              = (known after apply)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "appspec.json"
      + id                   = (known after apply)
    }

Plan: 2 to add, 0 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobID":"237da65e-fbba-49b1-aab1-1da45683b1bc","JobName":"shareable-lists-api_infrastructure_plan_prod","PRNumber":180,"Program":"tfcmt","SHA1":"7b1a8e5be6224bc6693734c1edbee8cce158220f","Target":"shareable-lists-api-cdk","Vars":{}} -->